In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [94]:
df = dataset['train'].to_pandas()
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [98]:
df_salary = df[(df['salary_year_avg'].notna())].copy(deep=True)

In [28]:
def projected_salary(salary):
  return salary * 1.03

In [29]:
df_salary['salary_year_avg'].apply(projected_salary)

28        112785.00
77        144200.00
92        123600.00
100       235068.66
109        91670.00
            ...
785624    143392.48
785641    154500.00
785648    228531.25
785682    162225.00
785692    162225.00
Name: salary_year_avg, Length: 22003, dtype: float64

In [39]:
df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(projected_salary)

In [49]:
s = list(df_salary[['salary_year_avg','salary_year_inflated']].sum())
print(s)
print(round(s[1]/s[0],4))

[2712667888.4023438, 2794047925.054414]
1.03

In [ ]:
df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

In [81]:
import ast
def parse_list(skill_list):
  return ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list

In [95]:
import ast
df['job_skills']=df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

In [ ]:
df[['job_skills','job_type_skills']]

In [125]:
def projected_salary(row):
  salary_year_inflated = row['salary_year_avg']
  if 'senior' in row['job_title_short'].lower():
    salary_year_inflated *= 1.05
  else:
    salary_year_inflated *= 1.03
  return salary_year_inflated

In [ ]:
df_salary['salary_year_inflated']=df_salary.apply(projected_salary,axis=1)

In [123]:
df_salary.head(20)[['job_title_short','salary_year_avg','salary_year_inflated']]

          job_title_short  salary_year_avg  salary_year_inflated
28         Data Scientist         109500.0             112785.00
77          Data Engineer         140000.0             144200.00
92          Data Engineer         120000.0             123600.00
100        Data Scientist         228222.0             235068.66
109          Data Analyst          89000.0              91670.00
116        Data Scientist         114000.0             117420.00
146         Data Engineer         129500.0             133385.00
180          Data Analyst          90250.0              92957.50
212        Data Scientist         157500.0             162225.00
257        Data Scientist         103128.0             106221.84
307         Data Engineer         185000.0             190550.00
339         Data Engineer         195000.0             200850.00
380         Data Engineer          97500.0             100425.00
388         Data Engineer          89000.0              91670.00
410          Data Analyst         133285.0             137283.55
450        Data Scientist         157500.0             162225.00
495  Senior Data Engineer         168500.0             176925.00
520      Business Analyst          63000.0              64890.00
545         Data Engineer          80000.0              82400.00
571         Data Engineer         110000.0             113300.00